# -*- coding: utf-8 -*-
"""Копия блокнота "DB.ipynb"

Automatically generated by Colaboratory.
# Создание базы данных и простейшие запросы

## Инструкция по выполнению задания
Ниже находится несколько  упражнений, представляющих собой код с пропущенными фрагментами, которые надо воспроизвести. Часть из этих упражнений очень простые, над некоторыми надо хорошенько подумать.

Чтобы выполнить это задание, нужно сохранить копию файла себе на Google Диск.
После выполнения задания, его нужно отправить на проверку. Для этого достаточно предоставить доступ к файлу и отправить ссылку в соответствующее поле LMS курса.
Удачи в выполнении заданий!

## Импортируем библиотеку sqlite3
"""

import sqlite3

"""### Упражнение 1 
Создайте базу данных (БД) и курсор к ней, чтобы далее работать с этой БД.
"""

#1
from sqlite3.dbapi2 import Cursor
con = sqlite3.connect("server.sqlite")

cursor = con.cursor()
cursor.execute('''CREATE TABLE IF NOT EXISTS users (
  userid INT PRIMARY KEY,
  fname TEXT,
  lname TEXT,
  gender TEXT,
  niknaim TEXT
)''')
con.commit()

cursor.execute("SELECT * FROM users ")
one_result = cursor.fetchone()
print(one_result)

"""### Упражнение 2
Создайте в новой БД таблицу с пятью столбцами. Не забывайте сохранять выполненные изменения в БД с помощью метода commit().
"""

#2
cursor.execute("""CREATE TABLE IF NOT EXISTS orders(
orderid INT PRIMARY KEY,
date DATE,
userid TEXT, 
total TEXT, 
gender TEXT);
""")
con.commit()

"""### Упражнение 3
Добавьте пять записей в БД.
"""

#3
cursor.execute("""INSERT INTO orders(orderid, date, userid, total, gender) 
VALUES('1', '2018-11-12', 'Peti232', 'male', 'M'),
('2', '2020-01-22', 'Vasi1', 'male', 'M'),
('3', '2020-06-09', 'Ivan9', 'male', 'M'),
('4', '2021-05-20', 'Swetlana01', 'female', 'W'),
('5', '2022-03-15', 'Saha3', 'male', 'M');""")
con.commit()

"""### Упражнение 4 
Запросите 3 записи из БД.
"""

cursor.execute("""SELECT * FROM orders LIMIT 1,3;""")
con.commit()

"""### Упражнение 5
Удалите одну из записей вашей БД.
"""

cursor.execute("""DELETE FROM orders WHERE orderid=3;""")
con.commit()